/* DeSmuME Strings File */
/* JAPANESE */

/* Dialog Box Titles */
"Open ROM" = "Open ROM";
"Open State File" = "Open State File";
"Save State File" = "Save State File";
"Import ROM Save File" = "Import ROM Save File";
"Export ROM Save File" = "Export ROM Save File";
"Select ROM" = "Select ROM";
"Select ADVANsCEne Database" = "Select ADVANsCEne Database";
"Select R4 Cheat Database" = "Select R4 Cheat Database";
"Select ARM7 BIOS Image" = "Select ARM7 BIOS Image";
"Select ARM9 BIOS Image" = "Select ARM9 BIOS Image";
"Select Firmware Image" = "Select Firmware Image";
"Save Screenshot" = "Save Screenshot";

/* Menus */
"Execute" = "スタート";
"Pause" = "ポーズ";
"Disable Speed Limit" = "Disable Speed Limit";
"Enable Speed Limit" = "Enable Speed Limit";
"Disable Auto Frame Skip" = "Disable Auto Frame Skip";
"Enable Auto Frame Skip" = "Enable Auto Frame Skip";
"Disable Cheats" = "Disable Cheats";
"Enable Cheats" = "Enable Cheats";
"Disable HUD" = "Disable HUD";
"Enable HUD" = "Enable HUD";
"Hide Status Bar" = "Hide Status Bar";
"Show Status Bar" = "ステータスバーを表示";
"Speed 1x" = "Speed 1x";
"Speed 2x" = "Speed 2x";
"Slot %d" = "スロット %d";

/* Alert Text */
"A critical file is missing. DeSmuME will now quit." = "A critical file is missing. DeSmuME will now quit.";
"The file \"DefaultUserPrefs.plist\" is missing. Please reinstall DeSmuME." = "The file \"DefaultUserPrefs.plist\" is missing. Please reinstall DeSmuME.";

/* Status Text */
"Ready." = "Ready.";

"Save state file loading failed!" = "Save state file loading failed!";
"Save state file loaded." = "Save state file loaded.";
"Save state file saving failed!" = "Save state file saving failed!";
"Save state file saved." = "Save state file saved.";
"Save state file reverting failed!" = "Save state file reverting failed!";
"Save state file reverted." = "Save state file reverted.";

"ROM save file import failed!" = "ROM save file import failed!";
"ROM save file imported." = "ROM save file imported.";
"ROM save file export failed!" = "ROM save file export failed!";
"ROM save file exported." = "ROM save file exported.";

"Loading ROM..." = "Loading ROM...";
"ROM loaded." = "ROM loaded.";
"ROM loading failed!" = "ROM loading failed!";
"Unloading ROM..." = "Unloading ROM...";
"ROM unloaded." = "ROM unloaded.";

"Emulator resetting..." = "Emulator resetting...";
"Emulator reset." = "Emulator reset.";

"Cannot generate the save file path!" = "Cannot generate the save file path!";
"Cannot create the save directory!" = "Cannot create the save directory!";

"Speed limit disabled." = "Speed limit disabled.";
"Speed limit enabled." = "Speed limit enabled.";
"Auto frame skip disabled." = "Auto frame skip disabled.";
"Auto frame skip enabled." = "Auto frame skip enabled.";
"Cheats disabled." = "Cheats disabled.";
"Cheats enabled." = "Cheats enabled.";
"HUD disabled." = "HUD disabled.";
"HUD enabled." = "HUD enabled.";

"Volume: %1.1f%%" = "ボリューム: %1.1f%%";

/* ROM Info Panel */
"No ROM loaded." = "No ROM loaded.";
"%i bytes" = "%i bytes";

/* Display Mode Strings */
"Main" = "Main";
"Touch" = "Touch";
"Combo" = "Combo";


/* LEGACY STRINGS */

/* General */
"DeSmuME Emulator" = "DeSmuME DSエミュレーター";
"OK" = "OK";
"Cancel" = "キャンセル";

/* File Menu */
//"Slot %d" = "スロット %d";

/* Emulation Menu */
//"Execute" = "スタート";
//"Pause" = "ポーズ";

/* View Menu */
//"Show Status Bar" = "ステータスバーを表示";
"Hide Status Bar" = "Hide Status Bar";

/* Dialogs */
"Are you sure you want to quit?" = "本当にやめますか？";
"Are you sure you want to close the ROM?" = "本当にROMを閉じますか？";

/* Status Bar Messages */
"No ROM Loaded" = "ROMを開けてください";
"Executing" = "再生しています";
"Paused" = "ポースしています";

/* Preferences Window */
"DeSmuME Preferences" = "DeSmuMEの環境設定";
"Interface" = "ジーユーアイ";
"Controls" = "入力";
"DS Firmware" = "DSのファームウェア";
"Yes" = "はい";
"No" = "いいえ";

/* Interface Preferences */
"Execute Upon Load" = "ロードしてスタート";
"When Launching, Load" = "DeSmuMEを開く時";
"Load Nothing" = "ROMを開かない";
"Load Last ROM" = "最近のROMを開く";

/* Control Preferences */
"A Button" = "Aボタン";
"B Button" = "Bボタン";
"X Button" = "Xボタン";
"Y Button" = "Yボタン";
"L Button" = "Lボタン";
"R Button" = "Rボタン";
"Up Button" = "上";
"Down Button" = "下";				
"Left Button" = "左";
"Right Button" = "右";			
"Start Button" = "スタート";
"Select Button" = "セレクト";

"Up Key" = "上";
"Down Key" = "下";
"Left Key" = "左";
"Right Key" = "右";
"Space Bar" = "スペースバー";
"Enter Key" = "エンター";

/* Status Bar */
"No ROM loaded" = "ROMが入っていません";
"ROM Loaded" = "ROMが入っています";
"Emulation Executing" = "";
"Emulation Paused" = "停止中";
"Emulation Reset" = "リセット";

/* Errors */
"Error" = "エラー";
"An emulation error occurred" = "エミュレーションのエラーで中断しています";
